In [67]:
import pandas as pd

BUSEINESS QUESTION: Group genres with budget and determine which genres perfom better per budget

MOVIE_INFO.TSV EXPLORATION

In [68]:
movie_info = pd.read_csv('/Users/gianna/Documents/Flatiron/phase-2-project/zippedData/rt.movie_info.tsv.gz', compression= 'gzip', sep= '\t', index_col='id')
movie_info.head()

,synopsis,rating,genre,director,writer,theater_date,dvd_date,currency,box_office,runtime,studio
id,,,,,,,,,,,
1,"This gritty, fast-paced, and innovative police...",R,Action and Adventure|Classics|Drama,William Friedkin,Ernest Tidyman,"Oct 9, 1971","Sep 25, 2001",NaN,NaN,104 minutes,NaN
3,"New York City, not-too-distant-future: Eric Pa...",R,Drama|Science Fiction and Fantasy,David Cronenberg,David Cronenberg|Don DeLillo,"Aug 17, 2012","Jan 1, 2013",$,"600,000",108 minutes,Entertainment One
5,Illeana Douglas delivers a superb performance ...,R,Drama|Musical and Performing Arts,Allison Anders,Allison Anders,"Sep 13, 1996","Apr 18, 2000",NaN,NaN,116 minutes,NaN
6,Michael Douglas runs afoul of a treacherous su...,R,Drama|Mystery and Suspense,Barry Levinson,Paul Attanasio|Michael Crichton,"Dec 9, 1994","Aug 27, 1997",NaN,NaN,128 minutes,NaN
7,NaN,NR,Drama|Romance,Rodney Bennett,Giles Cooper,NaN,NaN,NaN,NaN,200 minutes,NaN

In [69]:
movie_info.describe()

,synopsis,rating,genre,director,writer,theater_date,dvd_date,currency,box_office,runtime,studio
count,1498,1557,1552,1361,1111,1201,1201,340,340,1530,494
unique,1497,6,299,1125,1069,1025,717,1,336,142,200
top,A group of air crash survivors are stranded in...,R,Drama,Steven Spielberg,Woody Allen,"Jan 1, 1987","Jun 1, 2004",$,"600,000",90 minutes,Universal Pictures
freq,2,521,151,10,4,8,11,340,2,72,35

In [70]:
movie_info.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1560 entries, 1 to 2000
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   synopsis      1498 non-null   object
 1   rating        1557 non-null   object
 2   genre         1552 non-null   object
 3   director      1361 non-null   object
 4   writer        1111 non-null   object
 5   theater_date  1201 non-null   object
 6   dvd_date      1201 non-null   object
 7   currency      340 non-null    object
 8   box_office    340 non-null    object
 9   runtime       1530 non-null   object
 10  studio        494 non-null    object
dtypes: object(11)
memory usage: 146.2+ KB

In [71]:
len(movie_info)

1560

MOVIES.CSV EXPLORATION

In [72]:
tmdb_movies = pd.read_csv('/Users/gianna/Documents/Flatiron/phase-2-project/zippedData/tmdb.movies.csv.gz', compression = 'gzip', index_col = 'Unnamed: 0')
tmdb_movies.head()

,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186

In [73]:
tmdb_movies.info()

<class 'pandas.core.frame.DataFrame'>
Index: 26517 entries, 0 to 26516
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   genre_ids          26517 non-null  object
 1   id                 26517 non-null  int64
 2   original_language  26517 non-null  object
 3   original_title     26517 non-null  object
 4   popularity         26517 non-null  float64
 5   release_date       26517 non-null  object
 6   title              26517 non-null  object
 7   vote_average       26517 non-null  float64
 8   vote_count         26517 non-null  int64
dtypes: float64(2), int64(2), object(5)
memory usage: 2.0+ MB

In [74]:
tmdb_movies.describe(include= 'all')

,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
count,26517,26517.000000,26517,26517,26517.000000,26517,26517,26517.000000,26517.000000
unique,2477,NaN,76,24835,NaN,3433,24688,NaN,NaN
top,[99],NaN,en,Eden,NaN,2010-01-01,Eden,NaN,NaN
freq,3700,NaN,23291,7,NaN,269,7,NaN,NaN
mean,NaN,295050.153260,NaN,NaN,3.130912,NaN,NaN,5.991281,194.224837
std,NaN,153661.615648,NaN,NaN,4.355229,NaN,NaN,1.852946,960.961095
min,NaN,27.000000,NaN,NaN,0.600000,NaN,NaN,0.000000,1.000000
25%,NaN,157851.000000,NaN,NaN,0.600000,NaN,NaN,5.000000,2.000000
50%,NaN,309581.000000,NaN,NaN,1.374000,NaN,NaN,6.000000,5.000000
75%,NaN,419542.000000,NaN,NaN,3.694000,NaN,NaN,7.000000,28.000000
max,NaN,608444.000000,NaN,NaN,80.773000,NaN,NaN,10.000000,22186.000000

In [75]:
len(tmdb_movies)

26517

MOVIE BUDGETS. CSV EXPLORATION

In [76]:
movie_budgets = pd.read_csv('/Users/gianna/Documents/Flatiron/phase-2-project/zippedData/tn.movie_budgets.csv.gz', compression= 'gzip', index_col = 'id')
movie_budgets.head()

,release_date,movie,production_budget,domestic_gross,worldwide_gross
id,,,,,
1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [77]:
movie_budgets.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5782 entries, 1 to 82
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   release_date       5782 non-null   object
 1   movie              5782 non-null   object
 2   production_budget  5782 non-null   object
 3   domestic_gross     5782 non-null   object
 4   worldwide_gross    5782 non-null   object
dtypes: object(5)
memory usage: 271.0+ KB

In [78]:
movie_budgets.describe(include= 'all')

,release_date,movie,production_budget,domestic_gross,worldwide_gross
count,5782,5782,5782,5782,5782
unique,2418,5698,509,5164,5356
top,"Dec 31, 2014",Halloween,"$20,000,000",$0,$0
freq,24,3,231,548,367

In [79]:
len(movie_budgets)

5782

BOM.MOVIE GROSS EXPLORATION

In [80]:
movie_gross = pd.read_csv('/Users/gianna/Documents/Flatiron/phase-2-project/zippedData/bom.movie_gross.csv.gz', compression = 'gzip')
movie_gross.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

In [81]:
movie_gross.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           3387 non-null   object
 1   studio          3382 non-null   object
 2   domestic_gross  3359 non-null   float64
 3   foreign_gross   2037 non-null   object
 4   year            3387 non-null   int64
dtypes: float64(1), int64(1), object(3)
memory usage: 132.4+ KB

In [82]:
movie_gross.describe(include= 'all')

            title studio  domestic_gross foreign_gross         year
count        3387   3382    3.359000e+03          2037  3387.000000
unique       3386    257             NaN          1204          NaN
top     Bluebeard    IFC             NaN       1200000          NaN
freq            2    166             NaN            23          NaN
mean          NaN    NaN    2.874585e+07           NaN  2013.958075
std           NaN    NaN    6.698250e+07           NaN     2.478141
min           NaN    NaN    1.000000e+02           NaN  2010.000000
25%           NaN    NaN    1.200000e+05           NaN  2012.000000
50%           NaN    NaN    1.400000e+06           NaN  2014.000000
75%           NaN    NaN    2.790000e+07           NaN  2016.000000
max           NaN    NaN    9.367000e+08           NaN  2018.000000

In [83]:
len(movie_gross)

3387

IM.DB.ZIP EXPLORATION

In [84]:
import sqlite3
conn = sqlite3.connect('/Users/gianna/Documents/Flatiron/phase-2-project/unzippedData/im.db')
cursor = conn.cursor()

In [85]:
cursor.execute("""SELECT name FROM sqlite_master WHERE type='table';""")
tables = cursor.fetchall()
print(tables)

#list of all table names

[('movie_basics',), ('directors',), ('known_for',), ('movie_akas',), ('movie_ratings',), ('persons',), ('principals',), ('writers',)]

In [86]:
for table in tables:

    cursor.execute(f"PRAGMA table_info({table[0]});")
    table_name = table[0]
    columns = cursor.fetchall()
    print(f"Table: {table_name}") 
    print(columns)

#getting all columns for every table

Table: movie_basics
[(0, 'movie_id', 'TEXT', 0, None, 0), (1, 'primary_title', 'TEXT', 0, None, 0), (2, 'original_title', 'TEXT', 0, None, 0), (3, 'start_year', 'INTEGER', 0, None, 0), (4, 'runtime_minutes', 'REAL', 0, None, 0), (5, 'genres', 'TEXT', 0, None, 0)]
Table: directors
[(0, 'movie_id', 'TEXT', 0, None, 0), (1, 'person_id', 'TEXT', 0, None, 0)]
Table: known_for
[(0, 'person_id', 'TEXT', 0, None, 0), (1, 'movie_id', 'TEXT', 0, None, 0)]
Table: movie_akas
[(0, 'movie_id', 'TEXT', 0, None, 0), (1, 'ordering', 'INTEGER', 0, None, 0), (2, 'title', 'TEXT', 0, None, 0), (3, 'region', 'TEXT', 0, None, 0), (4, 'language', 'TEXT', 0, None, 0), (5, 'types', 'TEXT', 0, None, 0), (6, 'attributes', 'TEXT', 0, None, 0), (7, 'is_original_title', 'REAL', 0, None, 0)]
Table: movie_ratings
[(0, 'movie_id', 'TEXT', 0, None, 0), (1, 'averagerating', 'REAL', 0, None, 0), (2, 'numvotes', 'INTEGER', 0, None, 0)]
Table: persons
[(0, 'person_id', 'TEXT', 0, None, 0), (1, 'primary_name', 'TEXT', 0, None, 0), (2, 'birth_year', 'REAL', 0, None, 0), (3, 'death_year', 'REAL', 0, None, 0), (4, 'primary_profession', 'TEXT', 0, None, 0)]
Table: principals
[(0, 'movie_id', 'TEXT', 0, None, 0), (1, 'ordering', 'INTEGER', 0, None, 0), (2, 'person_id', 'TEXT', 0, None, 0), (3, 'category', 'TEXT', 0, None, 0), (4, 'job', 'TEXT', 0, None, 0), (5, 'characters', 'TEXT', 0, None, 0)]
Table: writers
[(0, 'movie_id', 'TEXT', 0, None, 0), (1, 'person_id', 'TEXT', 0, None, 0)]

In [87]:
tables_df = pd.DataFrame(tables, columns=['table_name'])
print(tables_df)
#converting table names to a dataframe

      table_name
0   movie_basics
1      directors
2      known_for
3     movie_akas
4  movie_ratings
5        persons
6     principals
7        writers

In [88]:

for table_name in tables_df['table_name']:
    print(f"=== Table: {table_name} ===")
    df = pd.read_sql(f"SELECT * FROM {table_name};", conn)
    print(df.describe(include='all'))  
    print("\n")

#doing .describe() on all tables to get info on column names

=== Table: movie_basics ===
         movie_id primary_title original_title     start_year  \
count      146144        146144         146123  146144.000000
unique     146144        136071         137773            NaN
top     tt0063540          Home         Broken            NaN
freq            1            24             19            NaN
mean          NaN           NaN            NaN    2014.621798
std           NaN           NaN            NaN       2.733583
min           NaN           NaN            NaN    2010.000000
25%           NaN           NaN            NaN    2012.000000
50%           NaN           NaN            NaN    2015.000000
75%           NaN           NaN            NaN    2017.000000
max           NaN           NaN            NaN    2115.000000

        runtime_minutes       genres
count     114405.000000       140736
unique              NaN         1085
top                 NaN  Documentary
freq                NaN        32185
mean          86.187247          NaN
std          166.360590          NaN
min            1.000000          NaN
25%           70.000000          NaN
50%           87.000000          NaN
75%           99.000000          NaN
max        51420.000000          NaN


=== Table: directors ===
         movie_id  person_id
count      291174     291174
unique     140417     109253
top     tt4050462  nm6935209
freq         3818        238


=== Table: known_for ===
        person_id   movie_id
count     1638260    1638260
unique     576444     514781
top     nm1202937  tt0806910
freq            6        633


=== Table: movie_akas ===
         movie_id       ordering       title  region language        types  \
count      331703  331703.000000      331703  278410    41715       168447
unique     122302            NaN      252781     213       76           10
top     tt2488496            NaN  Robin Hood      US       en  imdbDisplay
freq           61            NaN          32   51490    22895       100461
mean          NaN       5.125872         NaN     NaN      NaN          NaN
std           NaN       6.706664         NaN     NaN      NaN          NaN
min           NaN       1.000000         NaN     NaN      NaN          NaN
25%           NaN       1.000000         NaN     NaN      NaN          NaN
50%           NaN       2.000000         NaN     NaN      NaN          NaN
75%           NaN       6.000000         NaN     NaN      NaN          NaN
max           NaN      61.000000         NaN     NaN      NaN          NaN

       attributes  is_original_title
count       14925      331678.000000
unique         77                NaN
top     new title                NaN
freq         1700                NaN
mean          NaN           0.134769
std           NaN           0.341477
min           NaN           0.000000
25%           NaN           0.000000
50%           NaN           0.000000
75%           NaN           0.000000
max           NaN           1.000000


=== Table: movie_ratings ===
          movie_id  averagerating      numvotes
count        73856   73856.000000  7.385600e+04
unique       73856            NaN           NaN
top     tt10356526            NaN           NaN
freq             1            NaN           NaN
mean           NaN       6.332729  3.523662e+03
std            NaN       1.474978  3.029402e+04
min            NaN       1.000000  5.000000e+00
25%            NaN       5.500000  1.400000e+01
50%            NaN       6.500000  4.900000e+01
75%            NaN       7.400000  2.820000e+02
max            NaN      10.000000  1.841066e+06


=== Table: persons ===
        person_id   primary_name    birth_year   death_year primary_profession
count      606648         606648  82736.000000  6783.000000             555308
unique     606648         577203           NaN          NaN               8647
top     nm0061671  Michael Brown           NaN          NaN              actor
freq            1             16           NaN          NaN              88306
mean          NaN            NaN   1967.043826  2000.523367                NaN
std           NaN            NaN     22.122190    43.951530                NaN
min           NaN            NaN      1.000000    17.000000                NaN
25%           NaN            NaN   1957.000000  2001.000000                NaN
50%           NaN            NaN   1971.000000  2013.000000                NaN
75%           NaN            NaN   1981.000000  2016.000000                NaN
max           NaN            NaN   2014.000000  2019.000000                NaN


=== Table: principals ===
         movie_id      ordering  person_id category       job   characters
count     1028186  1.028186e+06    1028186  1028186    177684       393360
unique     143454           NaN     604546       12      2965       174762
top     tt2848734           NaN  nm1930572    actor  producer  ["Himself"]
freq           10           NaN        378   256718    108168        43584
mean          NaN  4.739847e+00        NaN      NaN       NaN          NaN
std           NaN  2.747446e+00        NaN      NaN       NaN          NaN
min           NaN  1.000000e+00        NaN      NaN       NaN          NaN
25%           NaN  2.000000e+00        NaN      NaN       NaN          NaN
50%           NaN  4.000000e+00        NaN      NaN       NaN          NaN
75%           NaN  7.000000e+00        NaN      NaN       NaN          NaN
max           NaN  1.000000e+01        NaN      NaN       NaN          NaN


=== Table: writers ===
         movie_id  person_id
count      255873     255873
unique     110261     122576
top     tt4050462  nm6935209
freq         3818        543

In [89]:
for table_name in tables_df['table_name']:
    cursor.execute(f"SELECT COUNT(*) FROM {table_name};")
    table_len = cursor.fetchone()[0]
    print(f"Table {table_name} has {table_len} rows")

#getting all lenght for each table

Table movie_basics has 146144 rows
Table directors has 291174 rows
Table known_for has 1638260 rows
Table movie_akas has 331703 rows
Table movie_ratings has 73856 rows
Table persons has 606648 rows
Table principals has 1028186 rows
Table writers has 255873 rows

In [90]:
for table_name in tables_df['table_name']:
    print(f"=== Table: {table_name} ===")
    df = pd.read_sql(f"SELECT * FROM {table_name};", conn)
    df.info()
    print("\n")

#doing .info() for all tables

=== Table: movie_basics ===
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 6 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   movie_id         146144 non-null  object
 1   primary_title    146144 non-null  object
 2   original_title   146123 non-null  object
 3   start_year       146144 non-null  int64
 4   runtime_minutes  114405 non-null  float64
 5   genres           140736 non-null  object
dtypes: float64(1), int64(1), object(4)
memory usage: 6.7+ MB


=== Table: directors ===
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 291174 entries, 0 to 291173
Data columns (total 2 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   movie_id   291174 non-null  object
 1   person_id  291174 non-null  object
dtypes: object(2)
memory usage: 4.4+ MB


=== Table: known_for ===
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1638260 entries, 0 to 1638259
Data columns (total 2 columns):
 #   Column     Non-Null Count    Dtype
---  ------     --------------    -----
 0   person_id  1638260 non-null  object
 1   movie_id   1638260 non-null  object
dtypes: object(2)
memory usage: 25.0+ MB


=== Table: movie_akas ===
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 331703 entries, 0 to 331702
Data columns (total 8 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   movie_id           331703 non-null  object
 1   ordering           331703 non-null  int64
 2   title              331703 non-null  object
 3   region             278410 non-null  object
 4   language           41715 non-null   object
 5   types              168447 non-null  object
 6   attributes         14925 non-null   object
 7   is_original_title  331678 non-null  float64
dtypes: float64(1), int64(1), object(6)
memory usage: 20.2+ MB


=== Table: movie_ratings ===
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 73856 entries, 0 to 73855
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   movie_id       73856 non-null  object
 1   averagerating  73856 non-null  float64
 2   numvotes       73856 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.7+ MB


=== Table: persons ===
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 606648 entries, 0 to 606647
Data columns (total 5 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   person_id           606648 non-null  object
 1   primary_name        606648 non-null  object
 2   birth_year          82736 non-null   float64
 3   death_year          6783 non-null    float64
 4   primary_profession  555308 non-null  object
dtypes: float64(2), object(3)
memory usage: 23.1+ MB


=== Table: principals ===
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1028186 entries, 0 to 1028185
Data columns (total 6 columns):
 #   Column      Non-Null Count    Dtype
---  ------      --------------    -----
 0   movie_id    1028186 non-null  object
 1   ordering    1028186 non-null  int64
 2   person_id   1028186 non-null  object
 3   category    1028186 non-null  object
 4   job         177684 non-null   object
 5   characters  393360 non-null   object
dtypes: int64(1), object(5)
memory usage: 47.1+ MB


=== Table: writers ===
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 255873 entries, 0 to 255872
Data columns (total 2 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   movie_id   255873 non-null  object
 1   person_id  255873 non-null  object
dtypes: object(2)
memory usage: 3.9+ MB

## creation of answer dataframe
this is a dataframe containing all necessary columns for analysis

We need movie info, tmdbmovies, moviebudgets, moviegross

In [91]:
print(movie_info.columns)
print(tmdb_movies.columns)
print(movie_budgets.columns)
print(movie_gross.columns)

Index(['synopsis', 'rating', 'genre', 'director', 'writer', 'theater_date',
       'dvd_date', 'currency', 'box_office', 'runtime', 'studio'],
      dtype='object')
Index(['genre_ids', 'id', 'original_language', 'original_title', 'popularity',
       'release_date', 'title', 'vote_average', 'vote_count'],
      dtype='object')
Index(['release_date', 'movie', 'production_budget', 'domestic_gross',
       'worldwide_gross'],
      dtype='object')
Index(['title', 'studio', 'domestic_gross', 'foreign_gross', 'year'], dtype='object')

### we have retrieved official genre id meanings from the movie database official api documenatation now we need to add this column containing official genre names

In [92]:
tmdb_genres = [
  { "id": 28, "name": "Action" },
  { "id": 12, "name": "Adventure" },
  { "id": 16, "name": "Animation" },
  { "id": 35, "name": "Comedy" },
  { "id": 80, "name": "Crime" },
  { "id": 99, "name": "Documentary" },
  { "id": 18, "name": "Drama" },
  { "id": 10751, "name": "Family" },
  { "id": 14, "name": "Fantasy" },
  { "id": 36, "name": "History" },
  { "id": 27, "name": "Horror" },
  { "id": 10402, "name": "Music" },
  { "id": 9648, "name": "Mystery" },
  { "id": 10749, "name": "Romance" },
  { "id": 878, "name": "Science Fiction" },
  { "id": 10770, "name": "TV Movie" },
  { "id": 53, "name": "Thriller" },
  { "id": 10752, "name": "War" },
  { "id": 37, "name": "Western" }
]

In [93]:
#extract all genre IDs
movie_ids = [genre['id'] for genre in tmdb_genres]

print(movie_ids)

[28, 12, 16, 35, 80, 99, 18, 10751, 14, 36, 27, 10402, 9648, 10749, 878, 10770, 53, 10752, 37]

In [114]:
tmdb_movies['genre_ids'].unique

<bound method Series.unique of 0            [12, 14, 10751]
1        [14, 12, 16, 10751]
2              [12, 28, 878]
3            [16, 35, 10751]
4              [28, 878, 12]
                ...
26512               [27, 18]
26513               [18, 53]
26514           [14, 28, 12]
26515        [10751, 12, 28]
26516               [53, 27]
Name: genre_ids, Length: 26517, dtype: object>

In [109]:
tmdb_movies['genre_ids'].dtype
type(tmdb_movies['genre_ids'].iloc[0])

str

In [104]:
tmdb_movies.columns

Index(['genre_ids', 'id', 'original_language', 'original_title', 'popularity',
       'release_date', 'title', 'vote_average', 'vote_count'],
      dtype='object')

In [117]:
import ast

print(tmdb_movies.columns.tolist())  

#Convert strings to actuallists
tmdb_movies['genre_ids'] = tmdb_movies['genre_ids'].apply(
    lambda x: ast.literal_eval(x) if isinstance(x, str) else x
)

# TMDb genre offcial mapping from site
tmdb_genres = [
  { "id": 28, "name": "Action" },
  { "id": 12, "name": "Adventure" },
  { "id": 16, "name": "Animation" },
  { "id": 35, "name": "Comedy" },
  { "id": 80, "name": "Crime" },
  { "id": 99, "name": "Documentary" },
  { "id": 18, "name": "Drama" },
  { "id": 10751, "name": "Family" },
  { "id": 14, "name": "Fantasy" },
  { "id": 36, "name": "History" },
  { "id": 27, "name": "Horror" },
  { "id": 10402, "name": "Music" },
  { "id": 9648, "name": "Mystery" },
  { "id": 10749, "name": "Romance" },
  { "id": 878, "name": "Science Fiction" },
  { "id": 10770, "name": "TV Movie" },
  { "id": 53, "name": "Thriller" },
  { "id": 10752, "name": "War" },
  { "id": 37, "name": "Western" }
]

#mapping dictionary
genre_map = {g['id']: g['name'] for g in tmdb_genres}

#map IDs to genre names
tmdb_movies['genres'] = tmdb_movies['genre_ids'].apply(
    lambda ids: [genre_map.get(i, f"Unknown:{i}") for i in ids]
)

#Check
print(tmdb_movies[['genre_ids', 'genres']].head())

['genre_ids', 'id', 'original_language', 'original_title', 'popularity', 'release_date', 'title', 'vote_average', 'vote_count', 'genres']
             genre_ids                                   genres
0      [12, 14, 10751]             [Adventure, Fantasy, Family]
1  [14, 12, 16, 10751]  [Fantasy, Adventure, Animation, Family]
2        [12, 28, 878]     [Adventure, Action, Science Fiction]
3      [16, 35, 10751]              [Animation, Comedy, Family]
4        [28, 878, 12]     [Action, Science Fiction, Adventure]

In [118]:
print(tmdb_movies.columns)
print(movie_info.columns)

Index(['genre_ids', 'id', 'original_language', 'original_title', 'popularity',
       'release_date', 'title', 'vote_average', 'vote_count', 'genres'],
      dtype='object')
Index(['synopsis', 'rating', 'genre', 'director', 'writer', 'theater_date',
       'dvd_date', 'currency', 'box_office', 'runtime', 'studio'],
      dtype='object')